In [192]:
import matplotlib.pyplot as plt
import pandas as pd
import csv

sns.set()
%matplotlib inline

In [193]:
from sklearn.preprocessing import LabelEncoder
from sklearn.naive_bayes import GaussianNB
from sklearn.model_selection import train_test_split
from sklearn import metrics

In [194]:
# Inspect Data
data = pd.read_csv("C:/Users/ryoch/DataSets/Customer_Behaviour.csv")
data.shape

(400, 5)

In [195]:
# Check if there is null in the data
data.apply(lambda x: sum(x.isnull()))

User ID            0
Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

In [196]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User ID          400 non-null    int64
 1   Gender           400 non-null    object
 2   Age              400 non-null    int64
 3   EstimatedSalary  400 non-null    int64
 4   Purchased        400 non-null    int64
dtypes: int64(4), object(1)
memory usage: 15.8+ KB

In [197]:
data.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [198]:
data.tail()

      User ID  Gender  Age  EstimatedSalary  Purchased
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

In [199]:
# Defining Dataset
gender = list(data['Gender'])
age = list(data['Age'])
salary = list(data['EstimatedSalary'])
label = list(data['Purchased'])

In [200]:
# Encode text feature
gender_encoded = LabelEncoder().fit_transform(gender)
age_encoded = LabelEncoder().fit_transform(age)

In [201]:
# Convert features into single variable(list of tuples)
features = list(zip(gender_encoded, age_encoded, salary))

In [202]:
# Split to 80% train dataset, 20% test dataset
x_train, x_test, y_train, y_test = train_test_split(features, label,test_size=0.2,random_state=109)

In [203]:
# Create Gaussian Classifier
model = GaussianNB()
# Train the model using the training sets
model.fit(x_train, y_train)
predicted = model.predict(x_test)
print("Accuracy:",metrics.accuracy_score(y_test, predicted))

Accuracy: 0.8875

In [204]:
# Create new columns for this practice

# Age Range
def age_range(row):
    if row['Age'] <= 30:
        return 'Young'
    if row['Age'] > 30 and row['Age'] <= 45:
        return 'Mid'
    if row['Age'] > 45 and row['Age'] <= 60:
        return 'Old'
    
# Salary Range
def salary_range(row):
    if row['EstimatedSalary'] <= 40000:
        return 'Low'
    if row['EstimatedSalary'] > 40000 and row['EstimatedSalary'] <= 75000:
        return 'Average'
    if row['EstimatedSalary'] > 75000:
        return 'High'

data.apply (lambda row: age_range(row), axis=1)
data.apply (lambda row: salary_range(row), axis=1)

0          Low
1          Low
2      Average
3      Average
4         High
        ...
395    Average
396        Low
397        Low
398        Low
399        Low
Length: 400, dtype: object

In [205]:
data['Age Group'] = data.apply (lambda row: age_range(row), axis=1)
data['Salary Group'] = data.apply (lambda row: salary_range(row), axis=1)
data

      User ID  Gender  Age  EstimatedSalary  Purchased Age Group Salary Group
0    15624510    Male   19            19000          0     Young          Low
1    15810944    Male   35            20000          0       Mid          Low
2    15668575  Female   26            43000          0     Young      Average
3    15603246  Female   27            57000          0     Young      Average
4    15804002    Male   19            76000          0     Young         High
..        ...     ...  ...              ...        ...       ...          ...
395  15691863  Female   46            41000          1       Old      Average
396  15706071    Male   51            23000          1       Old          Low
397  15654296  Female   50            20000          1       Old          Low
398  15755018    Male   36            33000          0       Mid          Low
399  15594041  Female   49            36000          1       Old          Low

[400 rows x 7 columns]

In [206]:
# Define DataSets
gender = list(data['Gender'])
age_group = list(data['Age Group'])
salary_group = list(data['Salary Group'])
purchased = list(data['Purchased'])

In [207]:
# Encode features

# Gender - Female:0, Male:1
gender_encoded = LabelEncoder().fit_transform(gender)
# Age - Mid: 0, Young:1, Old:2
age_group_encoded = LabelEncoder().fit_transform(age_group)
# Salary - Average:0, High:1, Low:2
salary_group_encoded = LabelEncoder().fit_transform(salary_group)
# Purchased - 
label = LabelEncoder().fit_transform(purchased)

In [208]:
# Convert featurs into single variable
update_features = list(zip(gender_encoded, age_group_encoded, salary_group_encoded))

In [209]:
model.fit(features, label)
# Predict output
predicted = model.predict([[0,0,1]])
if predicted == 0:
    print("Not Purchased")
elif predicted == 1:
    print("Purchased")
else:
    print("You've got an error. Please check the code")

Not Purchased

In [210]:
# Split the data to 80% training data, 20% test data
x_train, x_test, y_train, y_test = train_test_split(update_features, label,test_size=0.2,random_state=109)

In [211]:
model.fit(x_train, y_train)
update_predicted = model.predict(x_test)
print("Accuracy:",metrics.accuracy_score(y_test, update_predicted))

Accuracy: 0.7875